#!/usr/bin/python3
# -*- coding: utf-8 -*-

# 1. Создайте функцию, принимающую на вход имя, возраст и
# город проживания человека. Функция должна возвращать строку вида
# «Василий, 21 год(а), проживает в городе Москва»

def resident(name, age, city):
    print(f"{name}, {age} год(а), проживает в городе {city}")


resident('Афонасий', '64', 'Кутаиси')
